---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MacroModuleIterator Properties
MacroModuleIterator Class See Also Send Feedback
---

The MacroModuleIterator type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace